InformationRegisters/СчетаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоПриобретению</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСУплаченногоНаТаможне</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаАкцизаПоРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализацииБУ</Name>
					<Comment>Счет доходов от реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииБУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииБУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииБУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСебестоимостиПриРеализацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииБУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииБУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииБУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализацииНУ</Name>
					<Comment>Счет доходов от реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовОтРеализацииНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСебестоимостиПриРеализацииНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоСебестоимостиПриРеализацииНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовПриВозвратеБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовПриВозвратеНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеБУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеБУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеБУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходовПриВозвратеНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаУчетаНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ЗаголовокСубконтоДоходовОтРеализацииБУ, ЗаголовокСубконтоДоходовОтРеализацииНУ
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовОтРеализацииБУ1", "СубконтоДоходовОтРеализацииБУ2", "СубконтоДоходовОтРеализацииБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовОтРеализацииБУ1", "ЗаголовокСубконтоДоходовОтРеализацииБУ2", "ЗаголовокСубконтоДоходовОтРеализацииБУ3"); 
		
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовОтРеализацииБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетДоходовОтРеализацииНУ);
    ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииНУ", "СчетДоходовОтРеализацииНУ");

	// ЗаголовокСубконтоДоходовПриВозвратеБУ, ЗаголовокСубконтоДоходовПриВозвратеНУ 
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовПриВозвратеБУ1", "СубконтоДоходовПриВозвратеБУ2", "СубконтоДоходовПриВозвратеБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовПриВозвратеБУ1", "ЗаголовокСубконтоДоходовПриВозвратеБУ2", "ЗаголовокСубконтоДоходовПриВозвратеБУ3"); 
		
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовПриВозвратеБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетДоходовПриВозвратеНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеБУ", "СчетДоходовПриВозвратеБУ");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеНУ", "СчетДоходовПриВозвратеНУ");
	
	// ЗаголовокСубконтоСебестоимостиПриРеализацииБУ, ЗаголовокСубконтоСебестоимостиПриРеализацииНУ
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоСебестоимостиПриРеализацииБУ1", "СубконтоСебестоимостиПриРеализацииБУ2", "СубконтоСебестоимостиПриРеализацииБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоСебестоимостиПриРеализацииБУ1", "ЗаголовокСубконтоСебестоимостиПриРеализацииБУ2", "ЗаголовокСубконтоСебестоимостиПриРеализацииБУ3"); 
		
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетСебестоимостиПриРеализацииБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетСебестоимостиПриРеализацииНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииБУ", "СчетСебестоимостиПриРеализацииБУ");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииНУ", "СчетСебестоимостиПриРеализацииНУ");
	
	// ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3"); 
		
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
	
	// ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3"); 
		
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
	
	Если Параметры.Ключ.Пустой() Тогда
		
		Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаБУПриИзменении(Элемент)
	
	Запись.СчетУчетаНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетУчетаБУ));
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПередачиБУПриИзменении(Элемент)
	
	Запись.СчетУчетаПередачиНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетУчетаПередачиБУ));
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовОтРеализацииБУПриИзменении(Элемент)
	
	Запись.СчетДоходовОтРеализацииНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетДоходовОтРеализацииБУ));
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовОтРеализацииБУ1", "СубконтоДоходовОтРеализацииБУ2", "СубконтоДоходовОтРеализацииБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовОтРеализацииБУ1", "ЗаголовокСубконтоДоходовОтРеализацииБУ2", "ЗаголовокСубконтоДоходовОтРеализацииБУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетДоходовОтРеализацииБУ, Запись, ПоляФормы);			
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовОтРеализацииБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетДоходовОтРеализацииНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовОтРеализацииНУПриИзменении(Элемент)
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовОтРеализацииНУ1", "СубконтоДоходовОтРеализацииНУ2", "СубконтоДоходовОтРеализацииНУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовОтРеализацииНУ1", "ЗаголовокСубконтоДоходовОтРеализацииНУ2", "ЗаголовокСубконтоДоходовОтРеализацииНУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетДоходовОтРеализацииНУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовОтРеализацииНУ, ПоляФормы, ЗаголовкиПолей);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииНУ", "СчетДоходовОтРеализацииНУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриВозвратеБУПриИзменении(Элемент)
	
	Запись.СчетДоходовПриВозвратеНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетДоходовПриВозвратеБУ));
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовПриВозвратеБУ1", "СубконтоДоходовПриВозвратеБУ2", "СубконтоДоходовПриВозвратеБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовПриВозвратеБУ1", "ЗаголовокСубконтоДоходовПриВозвратеБУ2", "ЗаголовокСубконтоДоходовПриВозвратеБУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетДоходовПриВозвратеБУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовПриВозвратеБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетДоходовПриВозвратеНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеБУ", "СчетДоходовПриВозвратеБУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриВозвратеНУПриИзменении(Элемент)
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоДоходовПриВозвратеНУ1", "СубконтоДоходовПриВозвратеНУ2", "СубконтоДоходовПриВозвратеНУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоДоходовПриВозвратеНУ1", "ЗаголовокСубконтоДоходовПриВозвратеНУ2", "ЗаголовокСубконтоДоходовПриВозвратеНУ3"); 
	
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетДоходовПриВозвратеНУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетДоходовПриВозвратеНУ, ПоляФормы, ЗаголовкиПолей);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеНУ", "СчетДоходовПриВозвратеНУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетСебестоимостиПриРеализацииБУПриИзменении(Элемент)
	
	Запись.СчетСебестоимостиПриРеализацииНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетСебестоимостиПриРеализацииБУ));
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоСебестоимостиПриРеализацииБУ1", "СубконтоСебестоимостиПриРеализацииБУ2", "СубконтоСебестоимостиПриРеализацииБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоСебестоимостиПриРеализацииБУ1", "ЗаголовокСубконтоСебестоимостиПриРеализацииБУ2", "ЗаголовокСубконтоСебестоимостиПриРеализацииБУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетСебестоимостиПриРеализацииБУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетСебестоимостиПриРеализацииБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетСебестоимостиПриРеализацииНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииБУ", "СчетСебестоимостиПриРеализацииБУ");
		
КонецПроцедуры

&НаКлиенте
Процедура СчетСебестоимостиПриРеализацииНУПриИзменении(Элемент)
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоСебестоимостиПриРеализацииНУ1", "СубконтоСебестоимостиПриРеализацииНУ2", "СубконтоСебестоимостиПриРеализацииНУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоСебестоимостиПриРеализацииНУ1", "ЗаголовокСубконтоСебестоимостиПриРеализацииНУ2", "ЗаголовокСубконтоСебестоимостиПриРеализацииНУ3"); 
	
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетСебестоимостиПриРеализацииНУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетСебестоимостиПриРеализацииНУ, ПоляФормы, ЗаголовкиПолей);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииНУ", "СчетСебестоимостиПриРеализацииНУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУПриИзменении(Элемент)
	
	Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ));
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3"); 
	
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
		
КонецПроцедуры

&НаКлиенте
Процедура СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУПриИзменении(Элемент)
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2", "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2", "ЗаголовокСубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, ПоляФормы, ЗаголовкиПолей);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
		
КонецПроцедуры

&НаКлиенте
Процедура СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУПриИзменении(Элемент)
	
	Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ));
	
	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3"); 
	
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, ПоляФормы, ЗаголовкиПолей, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУПриИзменении(Элемент)

	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2", "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3");
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2", "ЗаголовокСубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3"); 
		
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриИзмененииСчета(Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, Запись, ПоляФормы);				
	УстановитьЗаголовкиИДоступностьСубконто(Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, ПоляФормы, ЗаголовкиПолей);
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
	
КонецПроцедуры

&НаКлиенте          
Процедура СубконтоДоходовОтРеализацииБУ1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовОтРеализацииБУ, Запись.СчетДоходовОтРеализацииНУ, 1, Запись.СубконтоДоходовОтРеализацииБУ1, "СубконтоДоходовОтРеализацииНУ");	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииБУ2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");      
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовОтРеализацииБУ, Запись.СчетДоходовОтРеализацииНУ, 2, Запись.СубконтоДоходовОтРеализацииБУ2, "СубконтоДоходовОтРеализацииНУ");	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииБУ3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовОтРеализацииБУ", "СчетДоходовОтРеализацииБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовОтРеализацииБУ, Запись.СчетДоходовОтРеализацииНУ, 3, Запись.СубконтоДоходовОтРеализацииБУ3, "СубконтоДоходовОтРеализацииНУ");	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииБУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииБУ",  1, "СчетДоходовОтРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииБУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииБУ",  2, "СчетДоходовОтРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииБУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииБУ",  3, "СчетДоходовОтРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеБУ", "СчетДоходовПриВозвратеБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовПриВозвратеБУ, Запись.СчетДоходовПриВозвратеНУ, 1, Запись.СубконтоДоходовПриВозвратеБУ1, "СубконтоДоходовПриВозвратеНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеБУ", "СчетДоходовПриВозвратеБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовПриВозвратеБУ, Запись.СчетДоходовПриВозвратеНУ, 2, Запись.СубконтоДоходовПриВозвратеБУ2, "СубконтоДоходовПриВозвратеНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ДоходовПриВозвратеБУ", "СчетДоходовПриВозвратеБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетДоходовПриВозвратеБУ, Запись.СчетДоходовПриВозвратеНУ, 3, Запись.СубконтоДоходовПриВозвратеБУ3, "СубконтоДоходовПриВозвратеНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииБУ", "СчетСебестоимостиПриРеализацииБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетСебестоимостиПриРеализацииБУ, Запись.СчетСебестоимостиПриРеализацииНУ, 1, Запись.СубконтоСебестоимостиПриРеализацииБУ1, "СубконтоСебестоимостиПриРеализацииНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииБУ", "СчетСебестоимостиПриРеализацииБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетСебестоимостиПриРеализацииБУ, Запись.СчетСебестоимостиПриРеализацииНУ, 2, Запись.СубконтоСебестоимостиПриРеализацииБУ2, "СубконтоСебестоимостиПриРеализацииНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "СебестоимостиПриРеализацииБУ", "СчетСебестоимостиПриРеализацииБУ");	
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетСебестоимостиПриРеализацииБУ, Запись.СчетСебестоимостиПриРеализацииНУ, 3, Запись.СубконтоСебестоимостиПриРеализацииБУ3, "СубконтоСебестоимостиПриРеализацииНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 1, Запись.СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 2, Запись.СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");	
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 3, Запись.СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 1, Запись.СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");			
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 2, Запись.СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "ОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ");
	ОбщегоНазначенияБККлиентСервер.ЗаменитьСубконтоНУ(Запись, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ, Запись.СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ, 3, Запись.СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ");
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииНУ",  1, "СчетДоходовОтРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииНУ",  2, "СчетДоходовОтРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовОтРеализацииНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовОтРеализацииНУ",  3, "СчетДоходовОтРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеБУ",  1, "СчетДоходовПриВозвратеБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеБУ",  2, "СчетДоходовПриВозвратеБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеБУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеБУ",  3, "СчетДоходовПриВозвратеБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеНУ",  1, "СчетДоходовПриВозвратеНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеНУ",  2, "СчетДоходовПриВозвратеНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриВозвратеНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоДоходовПриВозвратеНУ",  3, "СчетДоходовПриВозвратеНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииБУ",  1, "СчетСебестоимостиПриРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииБУ",  2, "СчетСебестоимостиПриРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииБУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииБУ",  3, "СчетСебестоимостиПриРеализацииБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииНУ",  1, "СчетСебестоимостиПриРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииНУ",  2, "СчетСебестоимостиПриРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоСебестоимостиПриРеализацииНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоСебестоимостиПриРеализацииНУ",  3, "СчетСебестоимостиПриРеализацииНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", 1, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ",  2, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ",  3, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  1, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  2, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  3, "СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ",  1, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ",  2, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ",  3, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  1, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  2, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СубконтоНачалоВыбора(Элемент, "СубконтоОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ",  3, "СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямНУ", СтандартнаяОбработка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимостьСубконоНоменклатурнаяГруппа(Счет, ПоляФормы)

	КоличествоСубконтоНаСчете = Счет.ВидыСубконто.Количество();
	
	Для НомерСубконто = 1 По 3 Цикл
		
		Если НомерСубконто <= КоличествоСубконтоНаСчете Тогда
			
				Если ПоляФормы.Свойство("Субконто" + НомерСубконто) Тогда
					
					Если (НЕ Счет.ВидыСубконто[НомерСубконто-1].ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоТиповые.НоменклатурныеГруппы")) И
						 (НЕ Счет.ВидыСубконто[НомерСубконто-1].ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура")) Тогда		
						 
						ЭтаФорма.Элементы["Декорация" + ПоляФормы["Субконто" + НомерСубконто]].Видимость = Ложь;                                                  
						ЭтаФорма.Элементы[ПоляФормы["Субконто" + НомерСубконто]].Видимость = Истина;                                                  
						
						Продолжить;
						
					КонецЕсли;
					
					ЭтаФорма.Элементы["Декорация" + ПоляФормы["Субконто" + НомерСубконто]].Видимость = Истина;
					ЭтаФорма.Элементы[ПоляФормы["Субконто" + НомерСубконто]].Видимость = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиИДоступностьСубконто(СчетУчета, ПоляФормы, ЗаголовкиПолей, СчетУчетаНУ = Неопределено)

	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриВыбореСчета(СчетУчета, ЭтаФорма, ПоляФормы, ЗаголовкиПолей);
	
	УстановитьВидимостьСубконоНоменклатурнаяГруппа(СчетУчета, ПоляФормы);
	
	Если НЕ СчетУчетаНУ = Неопределено Тогда
		
		Для Каждого ПолеФормы Из ПоляФормы Цикл
			
			ПоляФормы.Вставить(ПолеФормы.Ключ, СтрЗаменить(ПолеФормы.Значение, "БУ", "НУ"));
			
		КонецЦикла;
		
		Для Каждого ЗаголовоеПоля Из ЗаголовкиПолей Цикл
			
			ЗаголовкиПолей.Вставить(ЗаголовоеПоля.Ключ, СтрЗаменить(ЗаголовоеПоля.Значение, "БУ", "НУ"));
			
		КонецЦикла;
		
		ПроцедурыБухгалтерскогоУчетаКлиентСервер.ПриВыбореСчета(СчетУчетаНУ, ЭтаФорма, ПоляФормы, ЗаголовкиПолей);
		
		УстановитьВидимостьСубконоНоменклатурнаяГруппа(СчетУчетаНУ, ПоляФормы);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СписокПараметровВыбораСубконто(Форма, ПараметрыОбъекта, ШаблонИмяПоляОбъекта, ИмяСчета)

	СписокПараметров = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		Если ТипЗнч(ПараметрыОбъекта[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", ПараметрыОбъекта[ИмяПоля]);
		ИначеЕсли ПроцедурыБухгалтерскогоУчетаКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора().СодержитТип(ТипЗнч(ПараметрыОбъекта[ИмяПоля])) Тогда
			СписокПараметров.Вставить("ДоговорКонтрагента", ПараметрыОбъекта[ИмяПоля]);
		ИначеЕсли ТипЗнч(ПараметрыОбъекта[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", ПараметрыОбъекта[ИмяПоля]);
		ИначеЕсли ТипЗнч(ПараметрыОбъекта[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", ПараметрыОбъекта[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Вставить("СчетУчета", Форма.Запись[ИмяСчета]);	
	СписокПараметров.Вставить("Организация", ПараметрыОбъекта.Организация);

	Возврат СписокПараметров;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, Суффикс, ИмяСчета)
	ПараметрыДокумента = СписокПараметровВыбораСубконто(Форма, Форма.Запись, "Субконто" + Суффикс + "%Индекс%", ИмяСчета);
	ПроцедурыБухгалтерскогоУчетаКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, Форма.Запись, "Субконто" + Суффикс + "%Индекс%", "Субконто" + Суффикс + "%Индекс%", ПараметрыДокумента);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНачалоВыбора(Элемент, ИмяЭлементаСубконто, ИндексСубконто, ИмяЭлементаСчета, СтандартнаяОбработка)
	СписокПараметров = СписокПараметровВыбораСубконто(ЭтаФорма, Запись, ИмяЭлементаСубконто + "%Индекс%", ИмяЭлементаСчета);
	ПроцедурыБухгалтерскогоУчетаКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, ИндексСубконто, СтандартнаяОбработка, СписокПараметров);
КонецПроцедуры
